https://medium.com/@arslancan.coding/reshaping-data-in-pandas-623aa9f830a1

In [8]:
import pandas as pd
data = {'Name': ['John', 'Mary', 'Peter', 'Paul'],
        'Age': [30, 25, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Male'],
        'Salary': [50000, 60000, 55000, 45000],
        'Department': ['Sales', 'Marketing', 'Sales', 'Marketing']}
df = pd.DataFrame(data)
print(df)

    Name  Age  Gender  Salary Department
0   John   30    Male   50000      Sales
1   Mary   25  Female   60000  Marketing
2  Peter   35    Male   55000      Sales
3   Paul   28    Male   45000  Marketing

In [7]:
pivot = df.pivot_table(index='Gender', columns='Department', values='Salary', aggfunc='mean')
print(pivot)

Department  Marketing    Sales
Gender
Female        60000.0      NaN
Male          45000.0  52500.0

In [9]:
melted = pd.melt(df, id_vars=['Name', 'Age'], value_vars=['Gender', 'Salary', 'Department'])
print(melted)

     Name  Age    variable      value
0    John   30      Gender       Male
1    Mary   25      Gender     Female
2   Peter   35      Gender       Male
3    Paul   28      Gender       Male
4    John   30      Salary      50000
5    Mary   25      Salary      60000
6   Peter   35      Salary      55000
7    Paul   28      Salary      45000
8    John   30  Department      Sales
9    Mary   25  Department  Marketing
10  Peter   35  Department      Sales
11   Paul   28  Department  Marketing

In [10]:
print(df)

    Name  Age  Gender  Salary Department
0   John   30    Male   50000      Sales
1   Mary   25  Female   60000  Marketing
2  Peter   35    Male   55000      Sales
3   Paul   28    Male   45000  Marketing

In [15]:
print(df)
print("-----")
s1 = df.set_index(['Department', 'Gender'])
print(s1)
print("-----")
print(s1.stack())
print("-----")
stacked = df.set_index(['Department', 'Gender']).stack().reset_index()
print(stacked)

    Name  Age  Gender  Salary Department
0   John   30    Male   50000      Sales
1   Mary   25  Female   60000  Marketing
2  Peter   35    Male   55000      Sales
3   Paul   28    Male   45000  Marketing
-----
                    Name  Age  Salary
Department Gender
Sales      Male     John   30   50000
Marketing  Female   Mary   25   60000
Sales      Male    Peter   35   55000
Marketing  Male     Paul   28   45000
-----
Department  Gender
Sales       Male    Name       John
                    Age          30
                    Salary    50000
Marketing   Female  Name       Mary
                    Age          25
                    Salary    60000
Sales       Male    Name      Peter
                    Age          35
                    Salary    55000
Marketing   Male    Name       Paul
                    Age          28
                    Salary    45000
dtype: object
-----
   Department  Gender level_2      0
0       Sales    Male    Name   John
1       Sales    Male     Age     30
2       Sales    Male  Salary  50000
3   Marketing  Female    Name   Mary
4   Marketing  Female     Age     25
5   Marketing  Female  Salary  60000
6       Sales    Male    Name  Peter
7       Sales    Male     Age     35
8       Sales    Male  Salary  55000
9   Marketing    Male    Name   Paul
10  Marketing    Male     Age     28
11  Marketing    Male  Salary  45000

In [12]:
unstacked = stacked.unstack()
print(unstacked)

Department  0         Sales
            1         Sales
            2         Sales
            3     Marketing
            4     Marketing
            5     Marketing
            6         Sales
            7         Sales
            8         Sales
            9     Marketing
            10    Marketing
            11    Marketing
Gender      0          Male
            1          Male
            2          Male
            3        Female
            4        Female
            5        Female
            6          Male
            7          Male
            8          Male
            9          Male
            10         Male
            11         Male
level_2     0          Name
            1           Age
            2        Salary
            3          Name
            4           Age
            5        Salary
            6          Name
            7           Age
            8        Salary
            9          Name
            10          Age
            11       Salary
0           0          John
            1            30
            2         50000
            3          Mary
            4            25
            5         60000
            6         Peter
            7            35
            8         55000
            9          Paul
            10           28
            11        45000
dtype: object